// place files you want to import through the `$lib` alias in this folder.

export function toUrlString(url: string) {
    switch (url) {
        case "special":
            return "スペシャル";
        case "gumi":
            return "アイプリカード♪コレクショングミ";
        case "millefeui":
            return "ミルフィーカード";
        default:
            if (url.startsWith("ring")) return `${url.replace("ring", "リング")}だん`;
            return `${url}だん`;
    }
}

export function isPromotion(category1: string) {
    switch (category1) {
        case "special":
            return true;
        case "gumi":
            return true;
        case "millefeui":
            return true;
        default:
            return false;
    }
}

export const characterList = [
    "ひまり",
    "みつき",
    "つむぎ",
    "つむぎ（プリンセスver.）",
    "サクラ",
    "タマキ",
    "アイリ",
    "リンリン",
    "チィ",
    "じゅりあ",
    "える",
    "ダークチィ",
    "ダークサクラ",
    "ダークタマキ",
    "ダークアイリ",
    "ダークリンリン"
];
export const buzzTypeList = [
    "ネオン",
    "ジュエル"
]
export const brandList = [
    "ポッピンハート",
    "ミラクルムーン",
    "フラワーマーチ",
    "スカーレットバタフライ",
    "ロゼッション",
    "レインボーキャンディ",
    "ベアベアベア",
    "ラブマイミュージック",
    "プリンセスリング",
    "キューティーカラット",
    "プリズムストーン",
    "クリスタルバース",
    "プリティーコレクション"
];
export const cardCategoryList = [
    {
        url: "ring1",
        categories: ["☆☆☆☆", "☆☆☆", "☆☆"]
    },
    {
        url: "6",
        categories: ["☆☆☆☆", "☆☆☆", "☆☆"]
    },
    {
        url: "5",
        categories: ["☆☆☆☆", "☆☆☆", "☆☆"]
    },
    {
        url: "4",
        categories: ["☆☆☆☆", "☆☆☆", "☆☆"]
    },
    {
        url: "3",
        categories: ["☆☆☆☆", "☆☆☆", "☆☆"]
    },
    {
        url: "2",
        categories: ["☆☆☆☆", "☆☆☆", "☆☆"]
    },
    {
        url: "1",
        categories: ["☆☆☆☆", "☆☆☆", "☆☆"]
    },
    {
        url: "special",
        categories: ["イベント", "コラボキャンペーン", "全国店頭配布", "あたりキャンペーン", "全国店頭大会(お店でアイプリグランプリ)", "ファンブック/雑誌付録", "グッズ"]
    },
    {
        url: "gumi",
        categories: ["アイプリカード♪コレクショングミ vol.3", "アイプリカード♪コレクショングミ vol.2", "アイプリカード♪コレクショングミ"]
    },
    {
        url: "millefeui",
        categories: ["ひみつのアイプリミルフィーカード vol.3", "ひみつのアイプリミルフィーカード vol.2", "ひみつのアイプリミルフィーカード vol.1"]
    }
]
export const itemCategoryList = [
    {
        url: "6",
        categories: ["6だん後半 ★★★★ピックアップ", "プリティーリズム・ディアマイフューチャー②", "6だん前半 ★★★★ピックアップ", "第5回アイプリグランプリ", "プリティーリズム・ディアマイフューチャー①", "はつねミクコラボ", "★★★", "★★", "ひみつのミラクルツアー2025", "ショップワッチャプリマジ！", "ショップはるやすみキャンペーン"]
    },
    {
        url: "5",
        categories: ["5だん後半 ★★★★ピックアップ", "ワッチャプリマジ！②", "5だん前半 ★★★★ピックアップ", "バズリウムひろば", "第4回アイプリグランプリ", "ワッチャプリマジ！①", "【推しの子】コラボ", "★★★", "★★", "2024→2025ウィンターツアー", "ショップワッチャプリマジ！", "ショップふゆやすみキャンペーン", "ショップナムコでプレゼントキャンペーン", "ショップモーリーファンタジー・PALOゲットキャンペーン"]
    },
    {
        url: "4",
        categories: ["4だん後半 ★★★★ピックアップ", "キラッとプリ☆チャン➁", "4だん前半 ★★★★ピックアップ", "第3回アイプリグランプリ", "キラッとプリ☆チャン①", "オシャレ魔女 ラブandベリー", "★★★", "★★", "2024オータムツアー"]
    },
    {
        url: "3",
        categories: ["3だん後半 ★★★★ピックアップ", "アイドルタイムプリパラ➁", "3だん前半 ★★★★ピックアップ", "第2回アイプリグランプリ", "アイドルタイムプリパラ①", "サンリオキャラクターズコラボ", "TGC 2024 A/W", "★★★", "★★", "2024サマーツアー"]
    },
    {
        url: "2",
        categories: ["2だん後半 ★★★★ピックアップ", "プリパラ②", "2だん前半 ★★★★ピックアップ", "第1回アイプリグランプリ", "プリパラ①", "初音ミクコラボ", "P丸様。コラボ", "★★★", "★★", "2だん マイキャラツアー"]
    },
    {
        url: "1",
        categories: ["1だん後半 ★★★★ピックアップ", "ワッチャプリマジ！", "1だん前半 ★★★★ピックアップ", "プリティーリズム・オーロラドリーム", "★★★", "★★"]
    },
    {
        url: "special",
        categories: ["ひみつのアイプリ排出カード", "マイキャラルーム", "グッズ", "全国店頭配布", "コラボキャンペーン", "お店でアイプリグランプリ", "ファンブック/雑誌付録", "グッズ(プレゼントコード)", "アイプリカード♪コレクショングミ"]
    }
]
